<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.LordOfTheJamf.jss-upload.Firefox</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>PATCH_NAME</key>
		<string>Mozilla Firefox</string>
		<key>PATCH_TEMPLATE</key>
		<string>PatchTemplate.xml</string>
<!-- 		<key>POLICY_CATEGORY</key>
		<string>Applications</string>
		<key>POLICY_TEMPLATE</key>
		<string></string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string></string> -->
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jss-upload.Firefox_EN</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MozillaURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>de12c87741408c953f98a9ba1e0fa1af624018fe</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/MozillaURLProvider.py</string>
				<key>sha256_hash</key>
				<string>2f206e659bfca93d8a61be8cf6630d64a0b3eda14c2da8b00784d208db8e2cbe</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.firefox-rc-en_US</key>
			<dict>
				<key>git_hash</key>
				<string>10541f07e781358fc489c1ed615de9ce85ee95a5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.download.recipe</string>
				<key>sha256_hash</key>
				<string>25f3d12e7586fb4970fb469b45a2b37f4aa0bc4a549ea93f082c77f1b4439d60</string>
			</dict>
			<key>com.github.autopkg.jss-upload.Firefox_EN</key>
			<dict>
				<key>path</key>
				<string>~/Firefox.jss-upload.recipe</string>
				<key>sha256_hash</key>
				<string>1a59e0b76a0222cc6677b6301234b2656ef3bdb25cdce951c3d142d8656c3051</string>
			</dict>
			<key>com.github.autopkg.pkg.Firefox_EN</key>
			<dict>
				<key>git_hash</key>
				<string>10541f07e781358fc489c1ed615de9ce85ee95a5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>cbfb554e9a975acad1a4a9dfb7ea1c68449689012e5898ca40ef29013591dd68</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>